tutorials/granularEulerFoam/biomassInclinedFlow/biomass32/0/U.air
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U.air;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    left
    {
      type               fixedValue;//
      value              uniform (0 0 0);
    }
    ramp
    {
      type               fixedValue;//
      value              uniform (0 0 0);
    }
    top
    {
      type               pressureInletOutletVelocity;
      phi                phi.air;
      value              $internalField;
    }
    right
    {
      type               pressureInletOutletVelocity;
      phi                phi.air;
      value              $internalField;
    }
    bottom
    {
      type               pressureInletOutletVelocity;
      phi                phi.air;
      value              $internalField;
    }
    defaultFaces
    {
        type               empty;
    }
}


// ************************************************************************* //
